---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleMaxResult
source: html/cd60e5e4-f6e8-dc66-3118-8ffc894cd1a6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleMaxResult Property

"Max. Result": Calculation Rule Max Result

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeCalcRuleMaxResult { get; }
```